onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Нето_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Нето_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Нето_КонтактныеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Catalogs/Нето_КонтактныеЛица/Нето_КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Нето_КонтактныеЛица</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Нето_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаОсновании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заметка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

onec-mid-base-11/src/CommonModules/Нето_ДоработкаФорм/Module.bsl
#Область ПрограммныйИнтерфейс
// Дорабатывает типовые формы программно при их создании на сервере.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - дорабатываемая форма.
//
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	// Начало. Нето. Точка входа программной доработки типовых форм
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		ДобавитьСписокКонтактныхЛиц(Форма);
	ИначеЕсли ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьЭлементыЗаказа(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);
	КонецЕсли;
	// Конец. Нето
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСписокКонтактныхЛиц(Форма)
	
	// Начало. Нето. Список контактных лиц на форме контрагента
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Нето_СписокКонтактныхЛиц",
		Новый ОписаниеТипов("ДинамическийСписок"), , "Контактные лица"));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Список = Форма.Нето_СписокКонтактныхЛиц;
	Список.ОсновнаяТаблица = "Справочник.Нето_КонтактныеЛица";
	Список.ДинамическоеСчитываниеДанных = Истина;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Форма.Объект.Ссылка;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения =
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Таблица = Форма.Элементы.Добавить("Нето_ТаблицаКонтактныхЛиц", Тип("ТаблицаФормы"));
	Таблица.ПутьКДанным = "Нето_СписокКонтактныхЛиц";
	Таблица.Заголовок = "Контактные лица";
	
	Колонка = Форма.Элементы.Добавить("Нето_КЛНаименование", Тип("ПолеФормы"), Таблица);
	Колонка.Вид = ВидПоляФормы.ПолеВвода;
	Колонка.ПутьКДанным = "Нето_СписокКонтактныхЛиц.Наименование";
	
	Колонка = Форма.Элементы.Добавить("Нето_КЛДолжность", Тип("ПолеФормы"), Таблица);
	Колонка.Вид = ВидПоляФормы.ПолеВвода;
	Колонка.ПутьКДанным = "Нето_СписокКонтактныхЛиц.Должность";
	
	Колонка = Форма.Элементы.Добавить("Нето_КЛТелефон", Тип("ПолеФормы"), Таблица);
	Колонка.Вид = ВидПоляФормы.ПолеВвода;
	Колонка.ПутьКДанным = "Нето_СписокКонтактныхЛиц.КонтактныйТелефон";
	Колонка.Заголовок = "Телефон";
	// Конец. Нето
	
КонецПроцедуры

Процедура ДобавитьЭлементыЗаказа(Форма)
	
	// Начало. Нето. Поле скидки, контактное лицо и кнопка пересчета в заказе
	ГруппаШапка = Форма.Элементы.ГруппаШапкаПраво;
	
	ПолеСкидка = Форма.Элементы.Добавить("Нето_ПолеСогласованнаяСкидка", Тип("ПолеФормы"), ГруппаШапка);
	ПолеСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСкидка.ПутьКДанным = "Объект.Нето_СогласованнаяСкидка";
	ПолеСкидка.Заголовок = "Согласованная скидка, %";
	ПолеСкидка.УстановитьДействие("ПриИзменении", "Нето_СогласованнаяСкидкаПриИзменении");
	
	ПолеКонтактноеЛицо = Форма.Элементы.Добавить("Нето_ПолеКонтактноеЛицо", Тип("ПолеФормы"), ГруппаШапка);
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеКонтактноеЛицо.ПутьКДанным = "Объект.Нето_КонтактноеЛицо";
	ПолеКонтактноеЛицо.Заголовок = "Контактное лицо";
	
	Команда = Форма.Команды.Добавить("Нето_КомандаПересчитатьТаблицы");
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Действие = "Нето_ПересчитатьТаблицы";
	
	Кнопка = Форма.Элементы.Добавить("Нето_КнопкаПересчитать", Тип("КнопкаФормы"), ГруппаШапка);
	Кнопка.ИмяКоманды = "Нето_КомандаПересчитатьТаблицы";
	// Конец. Нето
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицо(Форма)
	
	// Начало. Нето. Поле контактного лица с отбором по контрагенту документа
	ПолеКонтактноеЛицо = Форма.Элементы.Добавить("Нето_ПолеКонтактноеЛицо", Тип("ПолеФормы"));
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеКонтактноеЛицо.ПутьКДанным = "Объект.Нето_КонтактноеЛицо";
	ПолеКонтактноеЛицо.Заголовок = "Контактное лицо";
	// Конец. Нето
	
КонецПроцедуры

#КонецОбласти
